import React from "react";
import { PrimaryText } from "../../common/text/PrimaryText.styles";
import { SecondaryText } from "../../common/text/SecondaryText.styles";
import { StyledOurTeam } from "./ourTeam.styles";
import { TitleSection } from "../../common/text/TitleSection";
import { Col, Row } from "react-bootstrap";
import staff from "../../../assets/images/staff.jpg";
import CardStaff from "../cardStaff/CardStaff";
function OurTeam(props) {
  return (
    <StyledOurTeam>
      <TitleSection>
        <PrimaryText>فريق عملنا</PrimaryText>
        <SecondaryText>
          في مؤسسة العين الحديثة للمقاولات، نؤمن بأن نجاحنا يعتمد بشكل كبير على
          تفاني وإخلاص فريق عملنا المتخصص. يضم فريقنا مجموعة من المحترفين ذوي
          الخبرة العالية في مجالات الهندسة، والإدارة، والتخطيط، والتنفيذ. يعملون
          جاهدين لتحقيق أعلى معايير الجودة والابتكار في كل مشروع نقوم به.
        </SecondaryText>
      </TitleSection>

      <Row style={{ rowGap: "15px" }}>
        <CardStaff
          image={staff}
          name="محمد الأحمد"
          job="مهندس مدني و مدير تنفيذي"
          more={
            "محمد الأحمد هو مهندس مدني ذو خبرة واسعة في مجال البناء والتشييد، يشغل منصب المدير التنفيذي لمؤسسة العين الحديثة للمقاولات. يقود أحمد فرق العمل نحو النجاح من خلال رؤيته الاستراتيجية واهتمامه بالتفاصيل الدقيقة لضمان تقديم أعلى معايير الجودة والابتكار في كل مشروع."
          }
        />
        <CardStaff
          image={staff}
          name="محمد الأحمد"
          job="مهندس مدني و مدير تنفيذي"
          more={
            "محمد الأحمد هو مهندس مدني ذو خبرة واسعة في مجال البناء والتشييد، يشغل منصب المدير التنفيذي لمؤسسة العين الحديثة للمقاولات. يقود أحمد فرق العمل نحو النجاح من خلال رؤيته الاستراتيجية واهتمامه بالتفاصيل الدقيقة لضمان تقديم أعلى معايير الجودة والابتكار في كل مشروع."
          }
        />
        <CardStaff
          image={staff}
          name="محمد الأحمد"
          job="مهندس مدني و مدير تنفيذي"
          more={
            "محمد الأحمد هو مهندس مدني ذو خبرة واسعة في مجال البناء والتشييد، يشغل منصب المدير التنفيذي لمؤسسة العين الحديثة للمقاولات. يقود أحمد فرق العمل نحو النجاح من خلال رؤيته الاستراتيجية واهتمامه بالتفاصيل الدقيقة لضمان تقديم أعلى معايير الجودة والابتكار في كل مشروع."
          }
        />
        <CardStaff
          image={staff}
          name="محمد الأحمد"
          job="مهندس مدني و مدير تنفيذي"
          more={
            "محمد الأحمد هو مهندس مدني ذو خبرة واسعة في مجال البناء والتشييد، يشغل منصب المدير التنفيذي لمؤسسة العين الحديثة للمقاولات. يقود أحمد فرق العمل نحو النجاح من خلال رؤيته الاستراتيجية واهتمامه بالتفاصيل الدقيقة لضمان تقديم أعلى معايير الجودة والابتكار في كل مشروع."
          }
        />
    
      </Row>
    </StyledOurTeam>
  );
}

export default OurTeam;
